docs/source/_misc/slides/revealjs-with-org-layer.org
#+TITLE: Reveal.js with Org layer
#+SETUPFILE: ./setup

* /WHY?/

  #+ATTR_REVEAL: :frag (roll-in roll-in roll-in)
  1. You are already using [[https://www.spacemacs.org][Spacemacs]]
  2. You want to use [[https://orgmode.org][Org mode]] to create documents
  3. You want to present them as slideshows in [[https://www.w3.org/html][HTML]]

* Prerequisites

  #+ATTR_REVEAL: :frag (roll-in roll-in roll-in)
  1. [[https://www.spacemacs.org][Spacemacs]]

     #+BEGIN_NOTES
       *Notes:*

       - an [[https://www.gnu.org/software/emacs][Emacs]] distribution
       - with [[https://github.com/syl20bnr/spacemacs/stargazers][18.8k stars]] on [[https://github.com][GitHub]]
     #+END_NOTES

  2. [[https://www.spacemacs.org/layers/+emacs/org/README.html][Org layer]]

     #+BEGIN_NOTES
       *Notes:*

       -  enables [[https://orgmode.org][Org mode]] on [[https://www.spacemacs.org][Spacemacs]]
     #+END_NOTES

  3. [[https://revealjs.com][reveal.js]]

     #+BEGIN_NOTES
       *Notes:*

       - enables creating slide presentations on [[https://www.w3.org/html][HTML]]
     #+END_NOTES

* Install Org layer

  #+ATTR_REVEAL: :frag (roll-in roll-in roll-in)
  1. Open =.spacemacs=

     #+BEGIN_EXAMPLE
       Press: SPC f e d
     #+END_EXAMPLE

     #+BEGIN_NOTES
       *Notes:*

       - the =init= file (or initialization file) for [[https://www.spacemacs.org][Spacemacs]]
       - in plain [[https://www.gnu.org/software/emacs][Emacs]], this is the =.emacs=, =.emacs.el= or =init.el= inside the =.emacs.d= directory
     #+END_NOTES

  2. Add [[https://www.spacemacs.org/layers/+emacs/org/README.html][Org layer]]

     #+BEGIN_SRC emacs-lisp
       dotspacemacs-configuration-layers
       '(
         ...
         (org :variables
              org-enable-reveal-js-support t)
     #+END_SRC

     #+BEGIN_NOTES
       *Notes:*

       - loads the configuration layers during [[https://www.spacemacs.org][Spacemacs]] startup or sync
     #+END_NOTES

  3. Sync configuration

     #+BEGIN_EXAMPLE
       Press: SPC f e R
     #+END_EXAMPLE

     #+BEGIN_NOTES
       *Notes:*

       - loads the configuration layers without the need to re-open [[https://www.spacemacs.org][Spacemacs]]
     #+END_NOTES

* Setup [[https://revealjs.com][reveal.js]]

  #+ATTR_REVEAL: :frag (roll-in roll-in roll-in)
  1. Download the latest release

     #+BEGIN_SRC shell
       $ wget https://github.com/hakimel/reveal.js/archive/3.8.0.zip
     #+END_SRC

  2. Unzip [[https://github.com/hakimel/reveal.js/archive/3.8.0.zip][Source code]]

     #+BEGIN_SRC shell
       $ unzip 3.8.0.zip
     #+END_SRC

  3. Rename directory

     #+BEGIN_SRC shell
       $ mv reveal.js-3.8.0 reveal.js
     #+END_SRC

     #+BEGIN_NOTES
       *Notes:**

       - =./reveal.js= is the default relative path where the =org= file looks for the [[https://revealjs.com][reveal.js]] assets
     #+END_NOTES

* Create a slideshow

  #+ATTR_REVEAL: :frag (roll-in roll-in roll-in)
  1. Create an =.org= file

     #+BEGIN_EXAMPLE
       ,#+TITLE: Hello World!
       ,#+AUTHOR: @username
       ,#+OPTIONS: toc:nil num:nil

       ,* Do this

       And this will happen ...
     #+END_EXAMPLE

     #+BEGIN_NOTES
     *Notes:*

     - =#+TITLE= along with =#+AUTHOR= are what appears on the landing page
     - =toc:nil= removes Table of Contents
     - =num:nil= removes number in headings
     - =* Do this= is the heading and will be the title of a slide
     - =And this will happen ...= is the content of the slide
     #+END_NOTES

  2. Export to [[https://revealjs.com][reveal.js]]

     #+BEGIN_EXAMPLE
       # Export without opening a browser:
       Press: C-c C-e v V

       # Or export then open default browser:
       or press: C-c C-e v b
     #+END_EXAMPLE

* And that's it! :)

* References

  - [[https://www.spacemacs.org/layers/+emacs/org/README.html][Org layer]]

    =spacemacs.org/layers/+emacs/org/README.html=

  - [[https://github.com/yjwen/org-reveal][Org-Reveal]]

    =github.com/yjwen/org-reveal=

  - [[https://orgmode.org/manual][The Org Manual]]

    =orgmode.org/manual=
